load-test/results/improved-stress.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-test/product-list-stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 3m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 003/200 VUs, 34 complete and 0 interrupted iterations
default   [   1% ] 003/200 VUs  0m01.0s/3m00.0s

running (0m02.0s), 005/200 VUs, 115 complete and 0 interrupted iterations
default   [   1% ] 005/200 VUs  0m02.0s/3m00.0s

running (0m03.0s), 008/200 VUs, 225 complete and 0 interrupted iterations
default   [   2% ] 008/200 VUs  0m03.0s/3m00.0s

running (0m04.0s), 010/200 VUs, 381 complete and 0 interrupted iterations
default   [   2% ] 010/200 VUs  0m04.0s/3m00.0s

running (0m05.0s), 013/200 VUs, 560 complete and 0 interrupted iterations
default   [   3% ] 013/200 VUs  0m05.0s/3m00.0s

running (0m06.0s), 015/200 VUs, 731 complete and 0 interrupted iterations
default   [   3% ] 015/200 VUs  0m06.0s/3m00.0s

running (0m06.9s), 018/200 VUs, 891 complete and 0 interrupted iterations
default   [   4% ] 018/200 VUs  0m07.0s/3m00.0s

running (0m07.9s), 020/200 VUs, 1034 complete and 0 interrupted iterations
default   [   4% ] 020/200 VUs  0m08.0s/3m00.0s

running (0m08.9s), 022/200 VUs, 1193 complete and 0 interrupted iterations
default   [   5% ] 022/200 VUs  0m09.0s/3m00.0s

running (0m09.9s), 025/200 VUs, 1293 complete and 0 interrupted iterations
default   [   6% ] 025/200 VUs  0m10.0s/3m00.0s

running (0m10.9s), 027/200 VUs, 1425 complete and 0 interrupted iterations
default   [   6% ] 027/200 VUs  0m11.0s/3m00.0s

running (0m11.9s), 030/200 VUs, 1564 complete and 0 interrupted iterations
default   [   7% ] 030/200 VUs  0m12.0s/3m00.0s

running (0m12.9s), 032/200 VUs, 1725 complete and 0 interrupted iterations
default   [   7% ] 032/200 VUs  0m13.0s/3m00.0s

running (0m13.9s), 035/200 VUs, 1855 complete and 0 interrupted iterations
default   [   8% ] 035/200 VUs  0m14.0s/3m00.0s

running (0m14.9s), 037/200 VUs, 1948 complete and 0 interrupted iterations
default   [   8% ] 037/200 VUs  0m15.0s/3m00.0s

running (0m15.9s), 040/200 VUs, 2067 complete and 0 interrupted iterations
default   [   9% ] 040/200 VUs  0m16.0s/3m00.0s

running (0m16.9s), 042/200 VUs, 2181 complete and 0 interrupted iterations
default   [   9% ] 042/200 VUs  0m17.0s/3m00.0s

running (0m17.9s), 045/200 VUs, 2283 complete and 0 interrupted iterations
default   [  10% ] 045/200 VUs  0m18.0s/3m00.0s

running (0m18.9s), 047/200 VUs, 2373 complete and 0 interrupted iterations
default   [  11% ] 047/200 VUs  0m19.0s/3m00.0s

running (0m19.9s), 049/200 VUs, 2468 complete and 0 interrupted iterations
default   [  11% ] 049/200 VUs  0m20.0s/3m00.0s

running (0m20.9s), 050/200 VUs, 2544 complete and 0 interrupted iterations
default   [  12% ] 050/200 VUs  0m21.0s/3m00.0s

running (0m21.9s), 050/200 VUs, 2628 complete and 0 interrupted iterations
default   [  12% ] 050/200 VUs  0m22.0s/3m00.0s

running (0m22.9s), 050/200 VUs, 2708 complete and 0 interrupted iterations
default   [  13% ] 050/200 VUs  0m23.0s/3m00.0s

running (0m23.9s), 050/200 VUs, 2785 complete and 0 interrupted iterations
default   [  13% ] 050/200 VUs  0m24.0s/3m00.0s

running (0m24.9s), 050/200 VUs, 2896 complete and 0 interrupted iterations
default   [  14% ] 050/200 VUs  0m25.0s/3m00.0s

running (0m25.9s), 050/200 VUs, 3012 complete and 0 interrupted iterations
default   [  14% ] 050/200 VUs  0m26.0s/3m00.0s

running (0m26.9s), 050/200 VUs, 3147 complete and 0 interrupted iterations
default   [  15% ] 050/200 VUs  0m27.0s/3m00.0s

running (0m27.9s), 050/200 VUs, 3301 complete and 0 interrupted iterations
default   [  16% ] 050/200 VUs  0m28.0s/3m00.0s

running (0m28.9s), 050/200 VUs, 3429 complete and 0 interrupted iterations
default   [  16% ] 050/200 VUs  0m29.0s/3m00.0s

running (0m29.9s), 050/200 VUs, 3554 complete and 0 interrupted iterations
default   [  17% ] 050/200 VUs  0m30.0s/3m00.0s

running (0m30.9s), 050/200 VUs, 3688 complete and 0 interrupted iterations
default   [  17% ] 050/200 VUs  0m31.0s/3m00.0s

running (0m31.9s), 050/200 VUs, 3826 complete and 0 interrupted iterations
default   [  18% ] 050/200 VUs  0m32.0s/3m00.0s

running (0m32.9s), 050/200 VUs, 3967 complete and 0 interrupted iterations
default   [  18% ] 050/200 VUs  0m33.0s/3m00.0s

running (0m33.9s), 050/200 VUs, 4087 complete and 0 interrupted iterations
default   [  19% ] 050/200 VUs  0m34.0s/3m00.0s

running (0m34.9s), 050/200 VUs, 4218 complete and 0 interrupted iterations
default   [  19% ] 050/200 VUs  0m35.0s/3m00.0s

running (0m35.9s), 050/200 VUs, 4361 complete and 0 interrupted iterations
default   [  20% ] 050/200 VUs  0m36.0s/3m00.0s

running (0m36.7s), 050/200 VUs, 4473 complete and 0 interrupted iterations
default   [  21% ] 050/200 VUs  0m37.0s/3m00.0s

running (0m37.7s), 050/200 VUs, 4602 complete and 0 interrupted iterations
default   [  21% ] 050/200 VUs  0m38.0s/3m00.0s

running (0m38.7s), 050/200 VUs, 4743 complete and 0 interrupted iterations
default   [  22% ] 050/200 VUs  0m39.0s/3m00.0s

running (0m39.8s), 050/200 VUs, 4885 complete and 0 interrupted iterations
default   [  22% ] 050/200 VUs  0m40.0s/3m00.0s

running (0m40.7s), 050/200 VUs, 5001 complete and 0 interrupted iterations
default   [  23% ] 050/200 VUs  0m41.0s/3m00.0s

running (0m41.7s), 050/200 VUs, 5135 complete and 0 interrupted iterations
default   [  23% ] 050/200 VUs  0m42.0s/3m00.0s

running (0m42.7s), 050/200 VUs, 5278 complete and 0 interrupted iterations
default   [  24% ] 050/200 VUs  0m43.0s/3m00.0s

running (0m43.7s), 050/200 VUs, 5418 complete and 0 interrupted iterations
default   [  24% ] 050/200 VUs  0m44.0s/3m00.0s

running (0m44.7s), 050/200 VUs, 5541 complete and 0 interrupted iterations
default   [  25% ] 050/200 VUs  0m45.0s/3m00.0s

running (0m45.7s), 050/200 VUs, 5679 complete and 0 interrupted iterations
default   [  26% ] 050/200 VUs  0m46.0s/3m00.0s

running (0m46.7s), 050/200 VUs, 5806 complete and 0 interrupted iterations
default   [  26% ] 050/200 VUs  0m47.0s/3m00.0s

running (0m47.7s), 050/200 VUs, 5932 complete and 0 interrupted iterations
default   [  27% ] 050/200 VUs  0m48.0s/3m00.0s

running (0m48.7s), 050/200 VUs, 6064 complete and 0 interrupted iterations
default   [  27% ] 050/200 VUs  0m49.0s/3m00.0s

running (0m49.7s), 050/200 VUs, 6208 complete and 0 interrupted iterations
default   [  28% ] 050/200 VUs  0m50.0s/3m00.0s

running (0m50.7s), 052/200 VUs, 6348 complete and 0 interrupted iterations
default   [  28% ] 052/200 VUs  0m51.0s/3m00.0s

running (0m51.7s), 054/200 VUs, 6499 complete and 0 interrupted iterations
default   [  29% ] 054/200 VUs  0m52.0s/3m00.0s

running (0m52.7s), 057/200 VUs, 6662 complete and 0 interrupted iterations
default   [  29% ] 057/200 VUs  0m53.0s/3m00.0s

running (0m53.7s), 059/200 VUs, 6770 complete and 0 interrupted iterations
default   [  30% ] 059/200 VUs  0m54.0s/3m00.0s

running (0m54.7s), 062/200 VUs, 6913 complete and 0 interrupted iterations
default   [  31% ] 062/200 VUs  0m55.0s/3m00.0s

running (0m55.7s), 064/200 VUs, 7056 complete and 0 interrupted iterations
default   [  31% ] 064/200 VUs  0m56.0s/3m00.0s

running (0m56.7s), 067/200 VUs, 7198 complete and 0 interrupted iterations
default   [  32% ] 067/200 VUs  0m57.0s/3m00.0s

running (0m57.8s), 069/200 VUs, 7311 complete and 0 interrupted iterations
default   [  32% ] 069/200 VUs  0m58.0s/3m00.0s

running (0m58.8s), 072/200 VUs, 7424 complete and 0 interrupted iterations
default   [  33% ] 072/200 VUs  0m59.0s/3m00.0s

running (0m59.7s), 074/200 VUs, 7542 complete and 0 interrupted iterations
default   [  33% ] 074/200 VUs  1m00.0s/3m00.0s

running (1m00.7s), 077/200 VUs, 7679 complete and 0 interrupted iterations
default   [  34% ] 077/200 VUs  1m01.0s/3m00.0s

running (1m01.7s), 079/200 VUs, 7820 complete and 0 interrupted iterations
default   [  34% ] 079/200 VUs  1m02.0s/3m00.0s

running (1m02.7s), 082/200 VUs, 7965 complete and 0 interrupted iterations
default   [  35% ] 082/200 VUs  1m03.0s/3m00.0s

running (1m03.8s), 084/200 VUs, 8097 complete and 0 interrupted iterations
default   [  36% ] 084/200 VUs  1m04.0s/3m00.0s

running (1m04.7s), 087/200 VUs, 8253 complete and 0 interrupted iterations
default   [  36% ] 087/200 VUs  1m05.0s/3m00.0s

running (1m05.7s), 089/200 VUs, 8387 complete and 0 interrupted iterations
default   [  37% ] 089/200 VUs  1m06.0s/3m00.0s

running (1m06.6s), 092/200 VUs, 8513 complete and 0 interrupted iterations
default   [  37% ] 092/200 VUs  1m07.0s/3m00.0s

running (1m07.6s), 094/200 VUs, 8646 complete and 0 interrupted iterations
default   [  38% ] 094/200 VUs  1m08.0s/3m00.0s

running (1m08.6s), 097/200 VUs, 8788 complete and 0 interrupted iterations
default   [  38% ] 097/200 VUs  1m09.0s/3m00.0s

running (1m09.6s), 099/200 VUs, 8922 complete and 0 interrupted iterations
default   [  39% ] 099/200 VUs  1m10.0s/3m00.0s

running (1m10.6s), 100/200 VUs, 9047 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  1m11.0s/3m00.0s

running (1m11.6s), 100/200 VUs, 9171 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  1m12.0s/3m00.0s

running (1m12.6s), 100/200 VUs, 9292 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  1m13.0s/3m00.0s

running (1m13.6s), 100/200 VUs, 9409 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  1m14.0s/3m00.0s

running (1m14.6s), 100/200 VUs, 9486 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  1m15.0s/3m00.0s

running (1m15.6s), 100/200 VUs, 9591 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  1m16.0s/3m00.0s

running (1m16.6s), 100/200 VUs, 9727 complete and 0 interrupted iterations
default   [  43% ] 100/200 VUs  1m17.0s/3m00.0s

running (1m17.6s), 100/200 VUs, 9885 complete and 0 interrupted iterations
default   [  43% ] 100/200 VUs  1m18.0s/3m00.0s

running (1m18.6s), 100/200 VUs, 10042 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  1m19.0s/3m00.0s

running (1m19.6s), 100/200 VUs, 10195 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  1m20.0s/3m00.0s

running (1m20.6s), 100/200 VUs, 10355 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  1m21.0s/3m00.0s

running (1m21.6s), 100/200 VUs, 10520 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  1m22.0s/3m00.0s

running (1m22.6s), 100/200 VUs, 10684 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  1m23.0s/3m00.0s

running (1m23.6s), 100/200 VUs, 10843 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  1m24.0s/3m00.0s

running (1m24.6s), 100/200 VUs, 11007 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  1m25.0s/3m00.0s

running (1m25.6s), 100/200 VUs, 11169 complete and 0 interrupted iterations
default   [  48% ] 100/200 VUs  1m26.0s/3m00.0s

running (1m26.6s), 100/200 VUs, 11292 complete and 0 interrupted iterations
default   [  48% ] 100/200 VUs  1m27.0s/3m00.0s

running (1m27.6s), 100/200 VUs, 11434 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  1m28.0s/3m00.0s

running (1m28.6s), 100/200 VUs, 11592 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  1m29.0s/3m00.0s

running (1m29.6s), 100/200 VUs, 11748 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  1m30.0s/3m00.0s

running (1m30.6s), 100/200 VUs, 11910 complete and 0 interrupted iterations
default   [  51% ] 100/200 VUs  1m31.0s/3m00.0s

running (1m31.6s), 100/200 VUs, 12065 complete and 0 interrupted iterations
default   [  51% ] 100/200 VUs  1m32.0s/3m00.0s

running (1m32.6s), 100/200 VUs, 12217 complete and 0 interrupted iterations
default   [  52% ] 100/200 VUs  1m33.0s/3m00.0s

running (1m33.6s), 100/200 VUs, 12375 complete and 0 interrupted iterations
default   [  52% ] 100/200 VUs  1m34.0s/3m00.0s

running (1m34.6s), 100/200 VUs, 12520 complete and 0 interrupted iterations
default   [  53% ] 100/200 VUs  1m35.0s/3m00.0s

running (1m35.6s), 100/200 VUs, 12659 complete and 0 interrupted iterations
default   [  53% ] 100/200 VUs  1m36.0s/3m00.0s

running (1m36.5s), 100/200 VUs, 12816 complete and 0 interrupted iterations
default   [  54% ] 100/200 VUs  1m37.0s/3m00.0s

running (1m37.5s), 100/200 VUs, 12964 complete and 0 interrupted iterations
default   [  54% ] 100/200 VUs  1m38.0s/3m00.0s

running (1m38.5s), 100/200 VUs, 13092 complete and 0 interrupted iterations
default   [  55% ] 100/200 VUs  1m39.0s/3m00.0s

running (1m39.5s), 100/200 VUs, 13242 complete and 0 interrupted iterations
default   [  56% ] 100/200 VUs  1m40.0s/3m00.0s

running (1m40.5s), 104/200 VUs, 13408 complete and 0 interrupted iterations
default   [  56% ] 104/200 VUs  1m41.0s/3m00.0s

running (1m41.5s), 109/200 VUs, 13563 complete and 0 interrupted iterations
default   [  57% ] 109/200 VUs  1m42.0s/3m00.0s

running (1m42.5s), 114/200 VUs, 13716 complete and 0 interrupted iterations
default   [  57% ] 114/200 VUs  1m43.0s/3m00.0s

running (1m43.5s), 119/200 VUs, 13875 complete and 0 interrupted iterations
default   [  58% ] 119/200 VUs  1m44.0s/3m00.0s

running (1m44.5s), 124/200 VUs, 14030 complete and 0 interrupted iterations
default   [  58% ] 124/200 VUs  1m45.0s/3m00.0s

running (1m45.5s), 129/200 VUs, 14188 complete and 0 interrupted iterations
default   [  59% ] 129/200 VUs  1m46.0s/3m00.0s

running (1m46.5s), 134/200 VUs, 14354 complete and 0 interrupted iterations
default   [  59% ] 134/200 VUs  1m47.0s/3m00.0s

running (1m47.5s), 139/200 VUs, 14509 complete and 0 interrupted iterations
default   [  60% ] 139/200 VUs  1m48.0s/3m00.0s

running (1m48.5s), 144/200 VUs, 14660 complete and 0 interrupted iterations
default   [  61% ] 144/200 VUs  1m49.0s/3m00.0s

running (1m49.5s), 149/200 VUs, 14819 complete and 0 interrupted iterations
default   [  61% ] 149/200 VUs  1m50.0s/3m00.0s

running (1m50.5s), 154/200 VUs, 14983 complete and 0 interrupted iterations
default   [  62% ] 154/200 VUs  1m51.0s/3m00.0s

running (1m51.5s), 159/200 VUs, 15142 complete and 0 interrupted iterations
default   [  62% ] 159/200 VUs  1m52.0s/3m00.0s

running (1m52.5s), 164/200 VUs, 15300 complete and 0 interrupted iterations
default   [  63% ] 164/200 VUs  1m53.0s/3m00.0s

running (1m53.5s), 169/200 VUs, 15462 complete and 0 interrupted iterations
default   [  63% ] 169/200 VUs  1m54.0s/3m00.0s

running (1m54.5s), 174/200 VUs, 15624 complete and 0 interrupted iterations
default   [  64% ] 174/200 VUs  1m55.0s/3m00.0s

running (1m55.5s), 179/200 VUs, 15764 complete and 0 interrupted iterations
default   [  64% ] 179/200 VUs  1m56.0s/3m00.0s

running (1m56.5s), 184/200 VUs, 15910 complete and 0 interrupted iterations
default   [  65% ] 184/200 VUs  1m57.0s/3m00.0s

running (1m57.5s), 189/200 VUs, 16051 complete and 0 interrupted iterations
default   [  66% ] 189/200 VUs  1m58.0s/3m00.0s

running (1m58.5s), 194/200 VUs, 16207 complete and 0 interrupted iterations
default   [  66% ] 194/200 VUs  1m59.0s/3m00.0s

running (1m59.5s), 199/200 VUs, 16366 complete and 0 interrupted iterations
default   [  67% ] 199/200 VUs  2m00.0s/3m00.0s

running (2m00.5s), 200/200 VUs, 16521 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  2m01.0s/3m00.0s

running (2m01.5s), 200/200 VUs, 16639 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m02.0s/3m00.0s

running (2m02.5s), 200/200 VUs, 16794 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  2m03.0s/3m00.0s

running (2m03.5s), 200/200 VUs, 16938 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m04.0s/3m00.0s

running (2m04.5s), 200/200 VUs, 17068 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  2m05.0s/3m00.0s

running (2m05.5s), 200/200 VUs, 17187 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  2m06.0s/3m00.0s

running (2m06.4s), 200/200 VUs, 17320 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m07.0s/3m00.0s

running (2m07.4s), 200/200 VUs, 17448 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  2m08.0s/3m00.0s

running (2m08.4s), 200/200 VUs, 17545 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m09.0s/3m00.0s

running (2m09.4s), 200/200 VUs, 17685 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  2m10.0s/3m00.0s

running (2m10.4s), 200/200 VUs, 17799 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m11.0s/3m00.0s

running (2m11.4s), 200/200 VUs, 17919 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  2m12.0s/3m00.0s

running (2m12.4s), 200/200 VUs, 17990 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m13.0s/3m00.0s

running (2m13.4s), 200/200 VUs, 18073 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  2m14.0s/3m00.0s

running (2m14.4s), 200/200 VUs, 18169 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  2m15.0s/3m00.0s

running (2m15.4s), 200/200 VUs, 18302 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  2m16.0s/3m00.0s

running (2m16.4s), 200/200 VUs, 18446 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  2m17.0s/3m00.0s

running (2m17.4s), 200/200 VUs, 18589 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m18.0s/3m00.0s

running (2m18.4s), 200/200 VUs, 18743 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  2m19.0s/3m00.0s

running (2m19.4s), 200/200 VUs, 18897 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m20.0s/3m00.0s

running (2m20.4s), 200/200 VUs, 19038 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  2m21.0s/3m00.0s

running (2m21.4s), 200/200 VUs, 19192 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m22.0s/3m00.0s

running (2m22.4s), 200/200 VUs, 19349 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  2m23.0s/3m00.0s

running (2m23.4s), 200/200 VUs, 19462 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  2m24.0s/3m00.0s

running (2m24.4s), 200/200 VUs, 19550 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  2m25.0s/3m00.0s

running (2m25.4s), 200/200 VUs, 19631 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  2m26.0s/3m00.0s

running (2m26.4s), 200/200 VUs, 19724 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m27.0s/3m00.0s

running (2m27.4s), 200/200 VUs, 19837 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  2m28.0s/3m00.0s

running (2m28.4s), 200/200 VUs, 19965 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m29.0s/3m00.0s

running (2m29.4s), 200/200 VUs, 20098 complete and 0 interrupted iterations
default   [  83% ] 200/200 VUs  2m30.0s/3m00.0s

running (2m30.4s), 200/200 VUs, 20236 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  2m31.0s/3m00.0s

running (2m31.4s), 200/200 VUs, 20394 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  2m32.0s/3m00.0s

running (2m32.4s), 200/200 VUs, 20546 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  2m33.0s/3m00.0s

running (2m33.4s), 200/200 VUs, 20692 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  2m34.0s/3m00.0s

running (2m34.4s), 200/200 VUs, 20839 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  2m35.0s/3m00.0s

running (2m35.4s), 200/200 VUs, 20982 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  2m36.0s/3m00.0s

running (2m36.3s), 200/200 VUs, 21132 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  2m37.0s/3m00.0s

running (2m37.3s), 200/200 VUs, 21270 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  2m38.0s/3m00.0s

running (2m38.3s), 200/200 VUs, 21418 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  2m39.0s/3m00.0s

running (2m39.3s), 200/200 VUs, 21569 complete and 0 interrupted iterations
default   [  89% ] 200/200 VUs  2m40.0s/3m00.0s

running (2m40.3s), 198/200 VUs, 21700 complete and 0 interrupted iterations
default   [  89% ] 198/200 VUs  2m41.0s/3m00.0s

running (2m41.3s), 187/200 VUs, 21860 complete and 0 interrupted iterations
default   [  90% ] 187/200 VUs  2m42.0s/3m00.0s

running (2m42.3s), 177/200 VUs, 22016 complete and 0 interrupted iterations
default   [  91% ] 177/200 VUs  2m43.0s/3m00.0s

running (2m43.3s), 169/200 VUs, 22168 complete and 0 interrupted iterations
default   [  91% ] 169/200 VUs  2m44.0s/3m00.0s

running (2m44.3s), 156/200 VUs, 22327 complete and 0 interrupted iterations
default   [  92% ] 156/200 VUs  2m45.0s/3m00.0s

running (2m45.3s), 148/200 VUs, 22449 complete and 0 interrupted iterations
default   [  92% ] 148/200 VUs  2m46.0s/3m00.0s

running (2m46.3s), 136/200 VUs, 22589 complete and 0 interrupted iterations
default   [  93% ] 136/200 VUs  2m47.0s/3m00.0s

running (2m47.3s), 125/200 VUs, 22744 complete and 0 interrupted iterations
default   [  93% ] 125/200 VUs  2m48.0s/3m00.0s

running (2m48.3s), 116/200 VUs, 22875 complete and 0 interrupted iterations
default   [  94% ] 116/200 VUs  2m49.0s/3m00.0s

running (2m49.3s), 105/200 VUs, 22996 complete and 0 interrupted iterations
default   [  94% ] 105/200 VUs  2m50.0s/3m00.0s

running (2m50.3s), 098/200 VUs, 23103 complete and 0 interrupted iterations
default   [  95% ] 098/200 VUs  2m51.0s/3m00.0s

running (2m51.3s), 084/200 VUs, 23226 complete and 0 interrupted iterations
default   [  96% ] 084/200 VUs  2m52.0s/3m00.0s

running (2m52.3s), 073/200 VUs, 23374 complete and 0 interrupted iterations
default   [  96% ] 073/200 VUs  2m53.0s/3m00.0s

running (2m53.3s), 064/200 VUs, 23508 complete and 0 interrupted iterations
default   [  97% ] 064/200 VUs  2m54.0s/3m00.0s

running (2m54.3s), 055/200 VUs, 23645 complete and 0 interrupted iterations
default   [  97% ] 055/200 VUs  2m55.0s/3m00.0s

running (2m55.3s), 043/200 VUs, 23778 complete and 0 interrupted iterations
default   [  98% ] 043/200 VUs  2m56.0s/3m00.0s

running (2m56.3s), 033/200 VUs, 23891 complete and 0 interrupted iterations
default   [  98% ] 033/200 VUs  2m57.0s/3m00.0s

running (2m57.3s), 023/200 VUs, 24017 complete and 0 interrupted iterations
default   [  99% ] 023/200 VUs  2m58.0s/3m00.0s

running (2m58.3s), 011/200 VUs, 24159 complete and 0 interrupted iterations
default   [  99% ] 011/200 VUs  2m59.0s/3m00.0s

running (2m59.3s), 001/200 VUs, 24280 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  3m00.0s/3m00.0s

     ✓ status 200

     checks.........................: 100.00% 24282 out of 24282
     data_received..................: 355 MB  2.0 MB/s
     data_sent......................: 2.9 MB  16 kB/s
     http_req_blocked...............: avg=20.83µs  min=1.06µs       med=5.43µs   max=68.58ms p(90)=7.74µs   p(95)=10.24µs
     http_req_connecting............: avg=11.61µs  min=0s           med=0s       max=68.26ms p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=802.85ms min=74.78µs      med=652.46ms max=7.04s   p(90)=1.49s    p(95)=1.84s  
       { expected_response:true }...: avg=802.85ms min=74.78µs      med=652.46ms max=7.04s   p(90)=1.49s    p(95)=1.84s  
     http_req_failed................: 0.00%   0 out of 24282
     http_req_receiving.............: avg=551.93µs min=-104176672ns med=278.83µs max=46.48ms p(90)=906.38µs p(95)=1.78ms 
     http_req_sending...............: avg=33.9µs   min=3.99µs       med=17.73µs  max=19.78ms p(90)=33.71µs  p(95)=47.06µs
     http_req_tls_handshaking.......: avg=0s       min=0s           med=0s       max=0s      p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=802.26ms min=0s           med=651.96ms max=7.03s   p(90)=1.49s    p(95)=1.84s  
     http_reqs......................: 24282   135.366672/s
     iteration_duration.............: avg=806.02ms min=31.16ms      med=653.88ms max=7.04s   p(90)=1.5s     p(95)=1.84s  
     iterations.....................: 24282   135.366672/s
     list_latency...................: avg=802.85ms min=74.78µs      med=652.46ms max=7.04s   p(90)=1.49s    p(95)=1.84s  
     vus............................: 1       min=1              max=200
     vus_max........................: 200     min=200            max=200


running (2m59.4s), 000/200 VUs, 24282 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  3m0s